2016-04-19_09-02-36.898974/effective.yml
---
cli-aliases:
  gui:
    modules:
      jmeter:
        gui: true
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  report:
    reporting:
    - blazemeter
execution:
  concurrency:
    local: 600.0
  delay: 0
  distributed: []
  executor: jmeter
  hold-for: 60s
  iterations: null
  ramp-up: null
  scenario:
    concurrent-pool-size: 4
    data-sources: {}
    default-address: null
    disable-listeners: true
    force-parent-sample: true
    headers: {}
    keepalive: true
    modifications: {}
    properties:
      jmeter.save.saveservice.timestamp_format: ms
      jmeterengine.nongui.maxport: 4445
      jmeterengine.nongui.port: 4445
    requests:
    - assert: []
      assert-jsonpath: []
      assert-xpath: []
      body: null
      body-file: null
      extract-css-jquery: {}
      extract-jsonpath: {}
      extract-regexp: {}
      extract-xpath: {}
      headers: {}
      label: http://localhost:3000/1
      method: GET
      think-time: null
      timeout: null
      url: http://localhost:3000/1
    retrieve-resources: true
    store-cache: true
    store-cookie: true
    think-time: null
    timeout: 10000ms
    use-dns-cache-mgr: true
    variables: {}
  start-at: ''
  steps: null
  throughput:
    local: null
  write-xml-jtl: error
included-configs: []
install-id: bf0747c8-0d32-42bd-86d5-23ed70cd3115
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
  console:
    class: bzt.modules.console.ConsoleStatusReporter
    disable: false
  consolidator:
    buffer-multiplier: 2
    buffer-scale-choice: 0.5
    class: bzt.modules.aggregator.ConsolidatingAggregator
    generalize-labels: false
    ignore-labels:
    - ignore
    max-buffer-len: .inf
    min-buffer-len: 2
    percentiles:
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0
  fail-criteria:
    class: bzt.modules.passfail.PassFailStatus
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  grinder:
    class: bzt.modules.grinder.GrinderExecutor
    path: ~/.bzt/grinder-taurus/lib/grinder.jar
    properties:
      grinder.useConsole: false
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    gui: false
    memory-xmx: 4096M
    path: /Users/peter.marklund/.bzt/jmeter-taurus/bin/jmeter.sh
    plugins-download-link: http://jmeter-plugins.org/files/JMeterPlugins-{plugin}-1.4.0.zip
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeter.save.saveservice.timestamp_format: ms
      jmeterengine.force.system.exit: 'true'
      jmeterengine.nongui.maxport: 4445
      jmeterengine.nongui.port: 4445
      mode: Stripped
      summariser.name: ''
      user.classpath: /Users/peter.marklund/src/tv4/perf-test/2016-04-19_09-02-36.898974
    shutdown-port: 4445
    shutdown-wait: 5
    system-properties:
      sun.net.inetaddr.ttl: 0
    version: '2.13'
  jtl-loader: bzt.modules.jmeter.JMeterJTLLoaderExecutor
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  local:
    class: bzt.modules.provisioning.Local
  locust:
    class: bzt.modules.locustio.LocustIOExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pbench:
    class: bzt.modules.pbench.PBenchExecutor
  selenium:
    class: bzt.modules.selenium.SeleniumExecutor
    selenium-tools:
      junit:
        hamcrest-core: ~/.bzt/selenium-taurus/tools/junit/hamcrest-core.jar
        jar-name: compiled.jar
        path: ~/.bzt/selenium-taurus/tools/junit/junit.jar
        selenium-server: ~/.bzt/selenium-taurus/selenium-server.jar
        working-dir: classes
      nose:
        working-dir: classes
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
provisioning: local
reporting:
- dump-csv: null
  dump-xml: null
  failed-labels: false
  module: final_stats
  percentiles: true
  summary: true
  test-duration: true
- module: console
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
  module: monitoring
settings:
  aggregator: consolidator
  artifacts-dir: '%Y-%m-%d_%H-%M-%S.%f'
  check-interval: 1
  check-updates: true
  default-executor: jmeter
  hostaliases: {}
  proxy: {}
version: 1.4.3